src/assets/jpg/verifyBasicIndividualDataGeneral_Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:e="http://www.technisys.net/cmm/services/errors/v1.0"
    xmlns:md="http://www.technisys.net/cmm/services/metadata/v2.0"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <SOAP-ENV:Header>
        <md:metadata>
            <traceNumber>2662325</traceNumber>
            <serviceId>verifyBasicIndividualDataGeneral</serviceId>
            <serviceVersion>0.0</serviceVersion>
            <sessionId>251DC8DB42E4CA8CF9B233C98BA80DEF</sessionId>
            <targetChannel>
                <mnemonic>IN</mnemonic>
            </targetChannel>
            <executingChannel>
                <mnemonic>IN</mnemonic>
            </executingChannel>
            <address>ip=181.113.146.73;</address>
            <organizationId>uriTech=EMPRESA@2610609;uriSFB=Cedula#1900678432;</organizationId>
            <executingOperatorId>uriTech=OPERADOR_EMPRESA@2610616;uriSFB=Cedula#1900678432;OWNER=true;userName=evolutivo3;</executingOperatorId>
            <terminalId>host=ET0001;</terminalId>
            <featureId>ROL@5094</featureId>
            <locale>es_CR</locale>
            <customProperties />
        </md:metadata>
        <wsse:Security SOAP-ENV:mustUnderstand="true">
            <saml2:Assertion
                xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ID="_ID1" IssueInstant="2014-04-16T21:44:56.855Z" Version="2.0" xsi:type="saml2:AssertionType">
                <saml2:Issuer>PacificoMultichannelProperties</saml2:Issuer>
                <saml2:Subject>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>Token</ds:KeyAlias>
                                <ds:KeyValue>AZWCYBEIUSZQ9GB6BNQTQTLPOWWZOY/0</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>userId</ds:KeyAlias>
                                <ds:KeyValue>USROMNI</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>password</ds:KeyAlias>
                                <ds:KeyValue>Pacifico2015</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>ip</ds:KeyAlias>
                                <ds:KeyValue>10.1.226.140</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>agencia</ds:KeyAlias>
                                <ds:KeyValue>0</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>Agencia</ds:KeyAlias>
                                <ds:KeyValue>00</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>localidad</ds:KeyAlias>
                                <ds:KeyValue>1</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>autorizaEjecucion</ds:KeyAlias>
                                <ds:KeyValue>wsksq|A</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>autorizaEjecucionTC</ds:KeyAlias>
                                <ds:KeyValue>TRJMOVIBDP|A</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>autorizaEjecucionTCINT</ds:KeyAlias>
                                <ds:KeyValue>TRJINTERMABDP|A</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>autorizaEjecucionEstCta</ds:KeyAlias>
                                <ds:KeyValue>sADfggdfggPADSOP545B|A</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>idMensaje</ds:KeyAlias>
                                <ds:KeyValue>0</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>macAddress</ds:KeyAlias>
                                <ds:KeyValue>90-B1-1C-78-10-B4</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>avatarUrl</ds:KeyAlias>
                                <ds:KeyValue>https://www.intermatico.com</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>localidad</ds:KeyAlias>
                                <ds:KeyValue>0</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>localidadDescripcion</ds:KeyAlias>
                                <ds:KeyValue>GUAYAQUIL</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                    <saml2:SubjectConfirmation>
                        <saml2:SubjectConfirmationData xsi:type="saml2:KeyInfoConfirmationDataType">
                            <ds:KeyInfo
                                xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                                <ds:KeyAlias>tokenSeguridad</ds:KeyAlias>
                                <ds:KeyValue>WSPruebaConsultaBP</ds:KeyValue>
                            </ds:KeyInfo>
                        </saml2:SubjectConfirmationData>
                    </saml2:SubjectConfirmation>
                </saml2:Subject>
            </saml2:Assertion>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <srv:verifyBasicIndividualDataGeneralRequest
            xmlns:srv="http://www.technisys.net/cmm/services/verifyBasicIndividualDataGeneral/rq/v0.0">
            <customer name="customer">
                <identificationNumber>0255123077</identificationNumber>
                <identificationType>
                    <mnemonic>CED</mnemonic>
                </identificationType>
            </customer>
            <collection name="customers">
                <customer>
                    <electronicsContact>
                        <emailAddressComplete>gancoaaace@gmail.com</emailAddressComplete>
                    </electronicsContact>
                </customer>
                <customer>
                    <electronicsContact>
                        <emailAddressComplete>correodos@correo.com</emailAddressComplete>
                    </electronicsContact>
                </customer>
            </collection>
        </srv:verifyBasicIndividualDataGeneralRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
